"122"= "F1";
"120"= "F2";
"99"= "F3";
"118"= "F4";
"96"= "F5";
"97"= "F6";
"98"= "F7";
"100"= "F8";
"101"= "F9";
"109"= "F10";
"103"= "F11";
"111"= "F12";
"105"= "F13";
"107"= "F14";
"113"= "F15";
"106"= "F16";
"64"= "F17";
"79"= "F18";
"80"= "F19";

"125"= "down arrow";
"124"= "right arrow";
"123"= "left arrow";
"126"= "up arrow";

"114"= "help";
"115"= "home";
"121"= "page down";
"116"= "page up";
"117"= "del";
"119"= "end";

"36"="return";
"48"="tab";
"49"="space";
"51"="backspace";
"52"="enter";
"53"="esc";

"71"="clear";
"76"="enter";

"1001"="< none >";
"1002"="cmd + ";
"1003"="shift + ";
"1005"="opt + ";
"1006"="ctrl + ";